posts/mockito-varargs/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="description" content="使用mockito去mock可变参函数">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>mockito varargs | Andro's Blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://youxincao.github.io/blog/posts/mockito-varargs/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Andro Wei">
<link rel="prev" href="../javascript-basic/" title="javascript basic" type="text/html">
<meta property="og:site_name" content="Andro's Blog">
<meta property="og:title" content="mockito varargs">
<meta property="og:url" content="http://youxincao.github.io/blog/posts/mockito-varargs/">
<meta property="og:description" content="使用mockito去mock可变参函数">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-01-20T13:10:10+08:00">
<meta property="article:tag" content="mockito">
<meta property="article:tag" content="unit test">
<meta property="article:tag" content="varargs">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://youxincao.github.io/blog/">

                <span id="blog-title">Andro's Blog</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">文章存档</a>
                </li>
<li>
<a href="../../categories/">标签</a>
                </li>
<li>
<a href="../../rss.xml">RSS 源</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">源代码</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">mockito varargs</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../../authors/andro-wei/">Andro Wei</a>
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-01-20T13:10:10+08:00" itemprop="datePublished" title="2018-01-20 13:10">2018-01-20 13:10</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">源代码</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
介绍如何使用mockito去mock可变参数的函数，如Java的String.format，以及Android的Resource.getString等等。
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Mockito的通常用法</h2>
<div class="outline-text-2" id="text-1">
<p>
Mockito通常用在单元测试中，给定指定的输入，然后返回特定的值。比如
</p>

<div class="highlight"><pre><span></span><span class="c1">//创建mock对象，参数可以是类，也可以是接口  </span>
<span class="n">List</span><span class="o">&lt;</span><span class="n">String</span><span class="o">&gt;</span> <span class="n">list</span> <span class="o">=</span> <span class="n">mock</span><span class="o">(</span><span class="n">List</span><span class="o">.</span><span class="na">class</span><span class="o">);</span>  
<span class="c1">//设置方法的预期返回值  </span>
<span class="n">when</span><span class="o">(</span><span class="n">list</span><span class="o">.</span><span class="na">get</span><span class="o">(</span><span class="mi">0</span><span class="o">)).</span><span class="na">thenReturn</span><span class="o">(</span><span class="s">"helloworld"</span><span class="o">);</span>  
<span class="n">String</span> <span class="n">result</span> <span class="o">=</span> <span class="n">list</span><span class="o">.</span><span class="na">get</span><span class="o">(</span><span class="mi">0</span><span class="o">);</span>  
<span class="c1">//验证方法调用(是否调用了get(0))  </span>
<span class="n">verify</span><span class="o">(</span><span class="n">list</span><span class="o">).</span><span class="na">get</span><span class="o">(</span><span class="mi">0</span><span class="o">);</span>  
<span class="c1">//junit测试  </span>
<span class="n">Assert</span><span class="o">.</span><span class="na">assertEquals</span><span class="o">(</span><span class="s">"helloworld"</span><span class="o">,</span> <span class="n">result</span><span class="o">);</span>  
</pre></div>

<!--more-->
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">通常用法的局限性</h2>
<div class="outline-text-2" id="text-2">
<p>
上诉例子中，输入和输出都是确定的，输入0，返回helloworld。但是对于Android中Context.getString这种可变参数的方法，
如果要一一枚举输入输出可能就比较麻烦。
</p>

<div class="highlight"><pre><span></span><span class="kd">private</span> <span class="n">Context</span> <span class="n">context</span><span class="o">;</span>

<span class="nd">@Before</span>
<span class="kd">public</span> <span class="kt">void</span> <span class="nf">setup</span><span class="o">()</span> <span class="o">{</span>
   <span class="n">context</span> <span class="o">=</span> <span class="n">Mockito</span><span class="o">.</span><span class="na">mock</span><span class="o">(</span> <span class="n">Context</span><span class="o">.</span><span class="na">class</span> <span class="o">);</span>
   <span class="n">when</span><span class="o">(</span> <span class="n">context</span><span class="o">.</span><span class="na">getString</span><span class="o">(</span> <span class="n">R</span><span class="o">.</span><span class="na">string</span><span class="o">.</span><span class="na">hello_format</span><span class="o">,</span> <span class="s">"world"</span> <span class="o">)</span> <span class="o">).</span><span class="na">thenReturn</span><span class="o">(</span> <span class="s">"hello world"</span> <span class="o">);</span>
   <span class="n">when</span><span class="o">(</span> <span class="n">context</span><span class="o">.</span><span class="na">getString</span><span class="o">(</span> <span class="n">R</span><span class="o">.</span><span class="na">string</span><span class="o">.</span><span class="na">hello_range</span> <span class="o">,</span> <span class="s">"1"</span> <span class="o">,</span> <span class="s">"2"</span><span class="o">)</span> <span class="o">).</span><span class="na">thenReturn</span><span class="o">(</span> <span class="s">"from 1 to 2"</span> <span class="o">);</span>
<span class="o">}</span>

<span class="nd">@Test</span>
<span class="kd">public</span> <span class="kt">void</span> <span class="nf">contextGetString</span><span class="o">()</span> <span class="kd">throws</span> <span class="n">Exception</span> <span class="o">{</span>
  <span class="n">assertEquals</span><span class="o">(</span> <span class="s">"hello world"</span><span class="o">,</span> <span class="n">context</span><span class="o">.</span><span class="na">getString</span><span class="o">(</span> <span class="n">R</span><span class="o">.</span><span class="na">string</span><span class="o">.</span><span class="na">hello_format</span><span class="o">,</span> <span class="s">"world"</span> <span class="o">)</span> <span class="o">);</span>
  <span class="n">assertEquals</span><span class="o">(</span> <span class="s">"from 1 to 2"</span><span class="o">,</span> <span class="n">context</span><span class="o">.</span><span class="na">getString</span><span class="o">(</span> <span class="n">R</span><span class="o">.</span><span class="na">string</span><span class="o">.</span><span class="na">hello_range</span><span class="o">,</span> <span class="s">"1"</span><span class="o">,</span> <span class="s">"2"</span> <span class="o">)</span> <span class="o">);</span>
<span class="o">}</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">解决方案</h2>
<div class="outline-text-2" id="text-3">
<p>
在Mock Context.getString的时候，使用可变参数。然后捕获到用户输入的参数，调用String.format完成字符串的拼接，然后返回结果。
</p>
<div class="highlight"><pre><span></span><span class="kd">private</span> <span class="n">Context</span> <span class="n">context</span><span class="o">;</span>

<span class="nd">@Before</span>
<span class="kd">public</span> <span class="kt">void</span> <span class="nf">setup</span><span class="o">()</span> <span class="o">{</span>

  <span class="c1">// Android 平台的特殊性，需要准备好String id到String format 格式的format。</span>
  <span class="c1">// 实际应用中可以在程序中使用dom解析资源文件和反射R得到这个map。</span>
  <span class="kd">final</span> <span class="n">Map</span><span class="o">&lt;</span><span class="n">Integer</span><span class="o">,</span> <span class="n">String</span><span class="o">&gt;</span> <span class="n">map</span> <span class="o">=</span> <span class="k">new</span> <span class="n">HashMap</span><span class="o">();</span>
  <span class="n">map</span><span class="o">.</span><span class="na">put</span><span class="o">(</span> <span class="n">R</span><span class="o">.</span><span class="na">string</span><span class="o">.</span><span class="na">hello_format</span><span class="o">,</span> <span class="s">"hello %1$s"</span> <span class="o">);</span>
  <span class="n">map</span><span class="o">.</span><span class="na">put</span><span class="o">(</span> <span class="n">R</span><span class="o">.</span><span class="na">string</span><span class="o">.</span><span class="na">hello_range</span><span class="o">,</span> <span class="s">"from %1$s to %2$s"</span> <span class="o">);</span>

  <span class="n">context</span> <span class="o">=</span> <span class="n">Mockito</span><span class="o">.</span><span class="na">mock</span><span class="o">(</span> <span class="n">Context</span><span class="o">.</span><span class="na">class</span> <span class="o">);</span>
  <span class="kd">final</span> <span class="n">Set</span><span class="o">&lt;</span><span class="n">Map</span><span class="o">.</span><span class="na">Entry</span><span class="o">&lt;</span><span class="n">Integer</span><span class="o">,</span> <span class="n">String</span><span class="o">&gt;&gt;</span> <span class="n">entries</span> <span class="o">=</span> <span class="n">map</span><span class="o">.</span><span class="na">entrySet</span><span class="o">();</span>
  <span class="k">for</span> <span class="o">(</span> <span class="kd">final</span> <span class="n">Map</span><span class="o">.</span><span class="na">Entry</span><span class="o">&lt;</span><span class="n">Integer</span><span class="o">,</span> <span class="n">String</span><span class="o">&gt;</span> <span class="n">entry</span> <span class="o">:</span> <span class="n">entries</span> <span class="o">)</span> <span class="o">{</span>
    <span class="c1">// 便利mock所有key的get string方法。</span>
    <span class="n">when</span><span class="o">(</span> <span class="n">context</span><span class="o">.</span><span class="na">getString</span><span class="o">(</span> <span class="n">eq</span><span class="o">(</span> <span class="n">entry</span><span class="o">.</span><span class="na">getKey</span><span class="o">()</span> <span class="o">),</span> <span class="n">argThat</span><span class="o">(</span> <span class="k">new</span> <span class="n">GetStringVarargMatcher</span><span class="o">()</span> <span class="o">)</span> <span class="o">)</span> <span class="o">).</span><span class="na">thenAnswer</span><span class="o">(</span> <span class="k">new</span> <span class="n">Answer</span><span class="o">&lt;</span><span class="n">String</span><span class="o">&gt;()</span> <span class="o">{</span>
      <span class="nd">@Override</span>
      <span class="kd">public</span> <span class="n">String</span> <span class="nf">answer</span><span class="o">(</span> <span class="n">InvocationOnMock</span> <span class="n">invocation</span> <span class="o">)</span> <span class="kd">throws</span> <span class="n">Throwable</span> <span class="o">{</span>
	<span class="n">Object</span><span class="o">[]</span> <span class="n">args</span> <span class="o">=</span> <span class="k">new</span> <span class="n">Object</span><span class="o">[</span><span class="n">invocation</span><span class="o">.</span><span class="na">getArguments</span><span class="o">().</span><span class="na">length</span> <span class="o">-</span> <span class="mi">1</span><span class="o">];</span>
	<span class="k">for</span> <span class="o">(</span> <span class="kt">int</span> <span class="n">i</span> <span class="o">=</span> <span class="mi">1</span><span class="o">;</span> <span class="n">i</span> <span class="o">&lt;</span> <span class="n">invocation</span><span class="o">.</span><span class="na">getArguments</span><span class="o">().</span><span class="na">length</span><span class="o">;</span> <span class="n">i</span><span class="o">++</span> <span class="o">)</span> <span class="o">{</span>
	  <span class="n">args</span><span class="o">[</span><span class="n">i</span> <span class="o">-</span> <span class="mi">1</span><span class="o">]</span> <span class="o">=</span> <span class="n">invocation</span><span class="o">.</span><span class="na">getArgument</span><span class="o">(</span> <span class="n">i</span> <span class="o">);</span>
	<span class="o">}</span>
	<span class="k">return</span> <span class="n">String</span><span class="o">.</span><span class="na">format</span><span class="o">(</span> <span class="n">entry</span><span class="o">.</span><span class="na">getValue</span><span class="o">(),</span> <span class="n">args</span> <span class="o">);</span>
      <span class="o">}</span>
    <span class="o">}</span> <span class="o">);</span>
  <span class="o">}</span>
<span class="o">}</span>

<span class="kd">static</span> <span class="kd">class</span> <span class="nc">GetStringVarargMatcher</span> <span class="kd">implements</span> <span class="n">ArgumentMatcher</span><span class="o">,</span> <span class="n">VarargMatcher</span> <span class="o">{</span>

  <span class="nd">@Override</span>
  <span class="kd">public</span> <span class="kt">boolean</span> <span class="nf">matches</span><span class="o">(</span> <span class="n">Object</span> <span class="n">argument</span> <span class="o">)</span> <span class="o">{</span>
    <span class="k">return</span> <span class="kc">true</span><span class="o">;</span>
  <span class="o">}</span>
<span class="o">}</span>

<span class="nd">@Test</span>
<span class="kd">public</span> <span class="kt">void</span> <span class="nf">contextGetString</span><span class="o">()</span> <span class="kd">throws</span> <span class="n">Exception</span> <span class="o">{</span>
  <span class="n">assertEquals</span><span class="o">(</span> <span class="s">"hello world"</span><span class="o">,</span> <span class="n">context</span><span class="o">.</span><span class="na">getString</span><span class="o">(</span> <span class="n">R</span><span class="o">.</span><span class="na">string</span><span class="o">.</span><span class="na">hello_format</span><span class="o">,</span> <span class="s">"world"</span> <span class="o">)</span> <span class="o">);</span>
  <span class="n">assertEquals</span><span class="o">(</span> <span class="s">"from 1 to 2"</span><span class="o">,</span> <span class="n">context</span><span class="o">.</span><span class="na">getString</span><span class="o">(</span> <span class="n">R</span><span class="o">.</span><span class="na">string</span><span class="o">.</span><span class="na">hello_range</span><span class="o">,</span> <span class="s">"1"</span><span class="o">,</span> <span class="s">"2"</span> <span class="o">)</span> <span class="o">);</span>
<span class="o">}</span>
</pre></div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">优化</h2>
<div class="outline-text-2" id="text-4">
<p>
是否同时捕获到String id和后面的可变参数？这样就不需要循环，mock所有的key了。
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">参考</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>
<a href="https://static.javadoc.io/org.mockito/mockito-core/2.2.9/org/mockito/ArgumentMatcher.html">Mockito ArgumentMatcher JavaDoc</a>
</li>
<li>
<a href="http://stackoverflow.com/questions/2631596/how-to-properly-match-varargs-in-mockito">StackOverflow How to properly match varargs in mockito</a>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/mockito/" rel="tag">mockito</a></li>
            <li><a class="tag p-category" href="../../categories/unit-test/" rel="tag">unit test</a></li>
            <li><a class="tag p-category" href="../../categories/varargs/" rel="tag">varargs</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../javascript-basic/" rel="prev" title="javascript basic">前一篇</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:lun.wei@outlook.com">Andro Wei</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script src="../../assets/js/colorbox-i18n/jquery.colorbox-zh-CN.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("zh-cn");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
